Revit 2024 API
BuiltInFailures.RoomFailures Class
 Failures about Room.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class RoomFailures
Visual Basic
Public NotInheritable Class RoomFailures
Visual C++
public ref class RoomFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RoomFailures
See Also
BuiltInFailures.RoomFailures Members
Autodesk.Revit.DB Namespace